reports/local_500tunn(1)_10inst_1000batch_10user.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
           * thousand-vus: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
thousand-vus   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
thousand-vus   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
thousand-vus   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
thousand-vus   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
thousand-vus   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
thousand-vus   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
thousand-vus   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
thousand-vus   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
thousand-vus   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
thousand-vus   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
thousand-vus   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 92 complete and 0 interrupted iterations
thousand-vus   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
thousand-vus   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
thousand-vus   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 116 complete and 0 interrupted iterations
thousand-vus   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
thousand-vus   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
thousand-vus   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
thousand-vus   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
thousand-vus   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 156 complete and 0 interrupted iterations
thousand-vus   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 164 complete and 0 interrupted iterations
thousand-vus   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
thousand-vus   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
thousand-vus   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
thousand-vus   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 194 complete and 0 interrupted iterations
thousand-vus   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
thousand-vus   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
thousand-vus   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 216 complete and 0 interrupted iterations
thousand-vus   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 224 complete and 0 interrupted iterations
thousand-vus   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
thousand-vus   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
thousand-vus   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
thousand-vus   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 258 complete and 0 interrupted iterations
thousand-vus   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 264 complete and 0 interrupted iterations
thousand-vus   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
thousand-vus   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
thousand-vus   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
thousand-vus   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 298 complete and 0 interrupted iterations
thousand-vus   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 304 complete and 0 interrupted iterations
thousand-vus   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
thousand-vus   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
thousand-vus   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 328 complete and 0 interrupted iterations
thousand-vus   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 334 complete and 0 interrupted iterations
thousand-vus   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 342 complete and 0 interrupted iterations
thousand-vus   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
thousand-vus   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 360 complete and 0 interrupted iterations
thousand-vus   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 368 complete and 0 interrupted iterations
thousand-vus   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 376 complete and 0 interrupted iterations
thousand-vus   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 382 complete and 0 interrupted iterations
thousand-vus   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 390 complete and 0 interrupted iterations
thousand-vus   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 400 complete and 0 interrupted iterations
thousand-vus   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 410 complete and 0 interrupted iterations
thousand-vus   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 416 complete and 0 interrupted iterations
thousand-vus   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 422 complete and 0 interrupted iterations
thousand-vus   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 430 complete and 0 interrupted iterations
thousand-vus   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 440 complete and 0 interrupted iterations
thousand-vus   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 450 complete and 0 interrupted iterations
thousand-vus   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 456 complete and 0 interrupted iterations
thousand-vus   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 462 complete and 0 interrupted iterations
thousand-vus   [ 100% ] 10 VUs  1m00.0s/1m0s

running (1m01.0s), 02/10 VUs, 470 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 10 VUs  1m0s

running (1m01.2s), 00/10 VUs, 472 complete and 0 interrupted iterations
thousand-vus ✓ [ 100% ] 10 VUs  1m0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 472      ✗ 0   
     data_received..................: 471 kB  7.7 kB/s
     data_sent......................: 56 kB   918 B/s
     http_req_blocked...............: avg=5.39ms   min=248ns    med=721ns    max=256.41ms p(90)=1.61µs   p(95)=1.76µs  
     http_req_connecting............: avg=2.5ms    min=0s       med=0s       max=119.34ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=273.21ms min=236.12ms med=242.81ms max=637.04ms p(90)=366.28ms p(95)=429.87ms
       { expected_response:true }...: avg=273.21ms min=236.12ms med=242.81ms max=637.04ms p(90)=366.28ms p(95)=429.87ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 472 
     http_req_receiving.............: avg=114.88µs min=24.92µs  med=77.74µs  max=4.16ms   p(90)=167.11µs p(95)=211.61µs
     http_req_sending...............: avg=158.21µs min=46.63µs  med=127.13µs max=738.15µs p(90)=269.63µs p(95)=289.47µs
     http_req_tls_handshaking.......: avg=2.85ms   min=0s       med=0s       max=135.85ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=272.94ms min=235.95ms med=242.57ms max=636.66ms p(90)=365.98ms p(95)=429.61ms
     http_reqs......................: 472     7.717088/s
     iteration_duration.............: avg=1.28s    min=1.23s    med=1.24s    max=1.63s    p(90)=1.38s    p(95)=1.45s   
     iterations.....................: 472     7.717088/s
     vus............................: 2       min=2      max=10
     vus_max........................: 10      min=10     max=10